In [4]:
print("Helloworld")

Helloworld

In [5]:
import numpy as np
import pandas as pd

In [6]:
student_data = {
    '학번': [1001, 1002, 1003, 1004, 1005, 1006, 1007, 1008, 1009, 1010],
    '이름': ['김철수', '이영희', '박민수', '정지영', '최현우', '강수진', '윤준호', '송미라', '황태영', '조은지'],
    '성별': ['남', '여', '남', '여', '남', '여', '남', '여', '남', '여'],
    '나이': [21, 23, 22, 24, 20, 23, 22, 21, 24, np.nan],  # 결측치 포함
    '학과': ['컴퓨터공학', '경영학', '물리학', '화학', '수학', '영문학', '컴퓨터공학', '통계학', '경영학', '화학'],
    '학년': [1, 3, 2, 4, 1, 3, 2, 1, 4, 3],
    '평점': [3.5, 4.2, 3.1, 4.5, 3.8, 4.0, 3.2, 3.9, 4.1, 3.7],
    '장학금': [False, True, False, True, False, True, False, True, False, True],
    '입학일': ['2021-03-02', '2019-03-04', '2020-03-02', '2018-03-05', '2021-03-02',
              '2019-03-04', '2020-03-02', '2021-03-02', '2018-03-05', '2019-03-04']
}

In [7]:
df = pd.DataFrame(student_data)

In [8]:
df.tail()

     학번   이름 성별    나이     학과  학년   평점    장학금         입학일
5  1006  강수진  여  23.0    영문학   3  4.0   True  2019-03-04
6  1007  윤준호  남  22.0  컴퓨터공학   2  3.2  False  2020-03-02
7  1008  송미라  여  21.0    통계학   1  3.9   True  2021-03-02
8  1009  황태영  남  24.0    경영학   4  4.1  False  2018-03-05
9  1010  조은지  여   NaN     화학   3  3.7   True  2019-03-04

In [9]:
df.head()

     학번   이름 성별    나이     학과  학년   평점    장학금         입학일
0  1001  김철수  남  21.0  컴퓨터공학   1  3.5  False  2021-03-02
1  1002  이영희  여  23.0    경영학   3  4.2   True  2019-03-04
2  1003  박민수  남  22.0    물리학   2  3.1  False  2020-03-02
3  1004  정지영  여  24.0     화학   4  4.5   True  2018-03-05
4  1005  최현우  남  20.0     수학   1  3.8  False  2021-03-02

In [10]:
df.shape

(10, 9)

In [11]:
df.columns.tolist()

['학번', '이름', '성별', '나이', '학과', '학년', '평점', '장학금', '입학일']

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 9 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   학번      10 non-null     int64
 1   이름      10 non-null     object
 2   성별      10 non-null     object
 3   나이      9 non-null      float64
 4   학과      10 non-null     object
 5   학년      10 non-null     int64
 6   평점      10 non-null     float64
 7   장학금     10 non-null     bool
 8   입학일     10 non-null     object
dtypes: bool(1), float64(2), int64(2), object(4)
memory usage: 782.0+ bytes

In [13]:
df.describe()

               학번         나이         학년         평점
count    10.00000   9.000000  10.000000  10.000000
mean   1005.50000  22.222222   2.400000   3.800000
std       3.02765   1.394433   1.173788   0.439697
min    1001.00000  20.000000   1.000000   3.100000
25%    1003.25000  21.000000   1.250000   3.550000
50%    1005.50000  22.000000   2.500000   3.850000
75%    1007.75000  23.000000   3.000000   4.075000
max    1010.00000  24.000000   4.000000   4.500000

In [14]:
name_series = df['학과']

In [15]:
name_series.head()

0    컴퓨터공학
1      경영학
2      물리학
3       화학
4       수학
Name: 학과, dtype: object

In [16]:
subset = df[['이름', '평점']]

In [17]:
subset.head()

    이름   평점
0  김철수  3.5
1  이영희  4.2
2  박민수  3.1
3  정지영  4.5
4  최현우  3.8

In [18]:
first_row = df.iloc[0]

In [19]:
first_row

학번           1001
이름            김철수
성별              남
나이           21.0
학과          컴퓨터공학
학년              1
평점            3.5
장학금         False
입학일    2021-03-02
Name: 0, dtype: object

In [20]:
specific_rows = df.iloc[1:3]

In [21]:
specific_rows

     학번   이름 성별    나이   학과  학년   평점    장학금         입학일
1  1002  이영희  여  23.0  경영학   3  4.2   True  2019-03-04
2  1003  박민수  남  22.0  물리학   2  3.1  False  2020-03-02

In [22]:
male_students = df[df['성별'] == '남']

In [23]:
male_students

     학번   이름 성별    나이     학과  학년   평점    장학금         입학일
0  1001  김철수  남  21.0  컴퓨터공학   1  3.5  False  2021-03-02
2  1003  박민수  남  22.0    물리학   2  3.1  False  2020-03-02
4  1005  최현우  남  20.0     수학   1  3.8  False  2021-03-02
6  1007  윤준호  남  22.0  컴퓨터공학   2  3.2  False  2020-03-02
8  1009  황태영  남  24.0    경영학   4  4.1  False  2018-03-05

In [24]:
high_score_male = df[(df['성별'] == '남') & (df['평점'] >= 3.5)]

In [25]:
high_score_male

     학번   이름 성별    나이     학과  학년   평점    장학금         입학일
0  1001  김철수  남  21.0  컴퓨터공학   1  3.5  False  2021-03-02
4  1005  최현우  남  20.0     수학   1  3.8  False  2021-03-02
8  1009  황태영  남  24.0    경영학   4  4.1  False  2018-03-05

In [26]:
young_or_high_score = df[(df['나이'] < 22) | (df['평점'] > 4.0)]

In [27]:
young_or_high_score

     학번   이름 성별    나이     학과  학년   평점    장학금         입학일
0  1001  김철수  남  21.0  컴퓨터공학   1  3.5  False  2021-03-02
1  1002  이영희  여  23.0    경영학   3  4.2   True  2019-03-04
3  1004  정지영  여  24.0     화학   4  4.5   True  2018-03-05
4  1005  최현우  남  20.0     수학   1  3.8  False  2021-03-02
7  1008  송미라  여  21.0    통계학   1  3.9   True  2021-03-02
8  1009  황태영  남  24.0    경영학   4  4.1  False  2018-03-05

In [28]:
df_sorted_age = df.sort_values('나이')

In [29]:
df_sorted_age

     학번   이름 성별    나이     학과  학년   평점    장학금         입학일
4  1005  최현우  남  20.0     수학   1  3.8  False  2021-03-02
0  1001  김철수  남  21.0  컴퓨터공학   1  3.5  False  2021-03-02
7  1008  송미라  여  21.0    통계학   1  3.9   True  2021-03-02
2  1003  박민수  남  22.0    물리학   2  3.1  False  2020-03-02
6  1007  윤준호  남  22.0  컴퓨터공학   2  3.2  False  2020-03-02
1  1002  이영희  여  23.0    경영학   3  4.2   True  2019-03-04
5  1006  강수진  여  23.0    영문학   3  4.0   True  2019-03-04
3  1004  정지영  여  24.0     화학   4  4.5   True  2018-03-05
8  1009  황태영  남  24.0    경영학   4  4.1  False  2018-03-05
9  1010  조은지  여   NaN     화학   3  3.7   True  2019-03-04

In [30]:
df_sorted_score = df.sort_values('평점', ascending=False)

In [31]:
df_sorted_score

     학번   이름 성별    나이     학과  학년   평점    장학금         입학일
3  1004  정지영  여  24.0     화학   4  4.5   True  2018-03-05
1  1002  이영희  여  23.0    경영학   3  4.2   True  2019-03-04
8  1009  황태영  남  24.0    경영학   4  4.1  False  2018-03-05
5  1006  강수진  여  23.0    영문학   3  4.0   True  2019-03-04
7  1008  송미라  여  21.0    통계학   1  3.9   True  2021-03-02
4  1005  최현우  남  20.0     수학   1  3.8  False  2021-03-02
9  1010  조은지  여   NaN     화학   3  3.7   True  2019-03-04
0  1001  김철수  남  21.0  컴퓨터공학   1  3.5  False  2021-03-02
6  1007  윤준호  남  22.0  컴퓨터공학   2  3.2  False  2020-03-02
2  1003  박민수  남  22.0    물리학   2  3.1  False  2020-03-02

In [32]:
df_sorted_multiple = df.sort_values(['성별', '평점'], ascending=[True, False])

In [33]:
df_sorted_multiple

     학번   이름 성별    나이     학과  학년   평점    장학금         입학일
8  1009  황태영  남  24.0    경영학   4  4.1  False  2018-03-05
4  1005  최현우  남  20.0     수학   1  3.8  False  2021-03-02
0  1001  김철수  남  21.0  컴퓨터공학   1  3.5  False  2021-03-02
6  1007  윤준호  남  22.0  컴퓨터공학   2  3.2  False  2020-03-02
2  1003  박민수  남  22.0    물리학   2  3.1  False  2020-03-02
3  1004  정지영  여  24.0     화학   4  4.5   True  2018-03-05
1  1002  이영희  여  23.0    경영학   3  4.2   True  2019-03-04
5  1006  강수진  여  23.0    영문학   3  4.0   True  2019-03-04
7  1008  송미라  여  21.0    통계학   1  3.9   True  2021-03-02
9  1010  조은지  여   NaN     화학   3  3.7   True  2019-03-04

In [34]:
gender_group = df.groupby('성별')
gender_mean = gender_group.mean(numeric_only=True)

In [35]:
gender_mean

        학번     나이   학년    평점  장학금
성별
남   1005.0  21.80  2.0  3.54  0.0
여   1006.0  22.75  2.8  4.06  1.0

In [36]:
gender_agg = gender_group.agg({
    '나이': ['mean', 'min', 'max', 'count'],
    '평점': ['mean', 'min', 'max', 'std']
})

In [37]:
gender_agg

       나이                      평점
     mean   min   max count  mean  min  max       std
성별
남   21.80  20.0  24.0     5  3.54  3.1  4.1  0.415933
여   22.75  21.0  24.0     4  4.06  3.7  4.5  0.304959

In [38]:
df['나이_25초과'] = df['나이'] > 25
multi_group = df.groupby(['성별', '나이_25초과'])

In [39]:
multi_group.mean(numeric_only=True)

                학번     나이   학년    평점  장학금
성별 나이_25초과
남  False    1005.0  21.80  2.0  3.54  0.0
여  False    1006.0  22.75  2.8  4.06  1.0

In [40]:
df.isnull().sum()

학번         0
이름         0
성별         0
나이         1
학과         0
학년         0
평점         0
장학금        0
입학일        0
나이_25초과    0
dtype: int64

In [41]:
df[df.isnull().any(axis=1)]

     학번   이름 성별  나이  학과  학년   평점   장학금         입학일  나이_25초과
9  1010  조은지  여 NaN  화학   3  3.7  True  2019-03-04    False

In [42]:
df_dropna = df.dropna()

In [44]:
df_dropna_subset = df.dropna(subset=['나이'])

In [45]:
df_dropna_subset.shape

(9, 10)

In [46]:
df_dropna.shape

(9, 10)

In [47]:
df_filled = df.copy()
df_filled['나이'] = df_filled['나이'].fillna(0)

In [48]:
df_filled[df_filled['학번'] == 1010]

     학번   이름 성별   나이  학과  학년   평점   장학금         입학일  나이_25초과
9  1010  조은지  여  0.0  화학   3  3.7  True  2019-03-04    False

In [49]:
df_filled_mean = df.copy()
mean_age = df['나이'].mean()
df_filled_mean['나이'] = df_filled_mean['나이'].fillna(mean_age)

In [50]:
df_filled_mean[df_filled_mean['학번'] == 1010]

     학번   이름 성별         나이  학과  학년   평점   장학금         입학일  나이_25초과
9  1010  조은지  여  22.222222  화학   3  3.7  True  2019-03-04    False

In [51]:
df_filled_ffill = df.copy()
df_filled_ffill['나이'] = df_filled_ffill['나이'].ffill()

In [52]:
df_filled_ffill[df_filled_ffill['학번'] == 1010]

     학번   이름 성별    나이  학과  학년   평점   장학금         입학일  나이_25초과
9  1010  조은지  여  24.0  화학   3  3.7  True  2019-03-04    False

In [53]:
Q1 = df['평점'].quantile(0.25)
Q3 = df['평점'].quantile(0.75)
IQR = Q3 - Q1
lower_bound = Q1 - 1.5 * IQR
upper_bound = Q3 + 1.5 * IQR

In [56]:
print(f"하한값: {lower_bound}, 상한값: {upper_bound}")

하한값: 2.7625000000000006, 상한값: 4.862499999999999

In [54]:
outliers = df[(df['평점'] < lower_bound) | (df['평점'] > upper_bound)]

In [55]:
outliers

Empty DataFrame
Columns: [학번, 이름, 성별, 나이, 학과, 학년, 평점, 장학금, 입학일, 나이_25초과]
Index: []

In [57]:
df.dtypes

학번           int64
이름          object
성별          object
나이         float64
학과          object
학년           int64
평점         float64
장학금           bool
입학일         object
나이_25초과       bool
dtype: object

In [58]:
df['입학일_날짜'] = pd.to_datetime(df['입학일'])

In [59]:
df[['입학일', '입학일_날짜']].head()

          입학일     입학일_날짜
0  2021-03-02 2021-03-02
1  2019-03-04 2019-03-04
2  2020-03-02 2020-03-02
3  2018-03-05 2018-03-05
4  2021-03-02 2021-03-02

In [62]:
df['성별_범주'] = df['성별'].astype('category')
df['학과_범주'] = df['학과'].astype('category')
print(df.dtypes)

학번                  int64
이름                 object
성별                 object
나이                float64
학과                 object
학년                  int64
평점                float64
장학금                  bool
입학일                object
나이_25초과              bool
입학일_날짜     datetime64[ns]
성별_범주            category
학과_범주            category
dtype: object

In [61]:
gender_dummies = pd.get_dummies(df['성별'], prefix='성별')
print(gender_dummies.head())

    성별_남   성별_여
0   True  False
1  False   True
2   True  False
3  False   True
4   True  False